{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a3653f5b",
   "metadata": {},
   "source": [
    "#Exemplo de Query\n",
    "# DBPedia: obras de Chuck Berry\n",
    "\n",
    "select ?nome ?desc where { \n",
    "\n",
    "    ?s a dbo:MusicalArtist. \n",
    "\n",
    "    ?s foaf:name \"Chuck Berry\"@en . \n",
    "\n",
    "    ?w dbo:artist ?s. \n",
    "\n",
    "    ?w foaf:name ?nome. \n",
    "\n",
    "    ?w dbo:abstract ?desc \n",
    "    \n",
    "} LIMIT 1000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "62ea0f4f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('SELECT', 'SELECT', 1, (0, 6))\n",
      "('VAR', '?nome', 1, (7, 12))\n",
      "('VAR', '?desc', 1, (13, 18))\n",
      "('WHERE', 'WHERE', 1, (19, 24))\n",
      "('PUNCT', '{', 1, (24, 25))\n",
      "('NEWLINE', '\\n', 2, (26, 27))\n",
      "('VAR', '?s', 2, (27, 29))\n",
      "('QNAME', 'foaf:name', 2, (30, 39))\n",
      "('STRING', '\"Chuck Berry\"@en', 2, (40, 56))\n",
      "('PUNCT', '.', 2, (57, 58))\n",
      "('NEWLINE', '\\n', 3, (59, 60))\n",
      "('VAR', '?w', 3, (60, 62))\n",
      "('QNAME', 'dbo:artist', 3, (63, 73))\n",
      "('VAR', '?s', 3, (74, 76))\n",
      "('PUNCT', '.', 3, (76, 77))\n",
      "('NEWLINE', '\\n', 4, (78, 79))\n",
      "('VAR', '?w', 4, (79, 81))\n",
      "('QNAME', 'foaf:name', 4, (82, 91))\n",
      "('VAR', '?nome', 4, (92, 97))\n",
      "('PUNCT', '.', 4, (97, 98))\n",
      "('NEWLINE', '\\n', 5, (99, 100))\n",
      "('VAR', '?w', 5, (100, 102))\n",
      "('QNAME', 'dbo:abstract', 5, (103, 115))\n",
      "('VAR', '?desc', 5, (116, 121))\n",
      "('NEWLINE', '\\n', 6, (122, 123))\n",
      "('PUNCT', '}', 6, (123, 124))\n",
      "('LIMIT', 'LIMIT', 6, (125, 130))\n",
      "('INT', '1000', 6, (131, 135))\n",
      "('NEWLINE', '\\n', 7, (135, 136))\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "\n",
    "def Query(codigo):  \n",
    "    tokens = [\n",
    "        ('NEWLINE', r'\\n'),\n",
    "        ('SKIP', r'[ \\t]+'),\n",
    "        ('SELECT', r'SELECT\\b'),\n",
    "        ('WHERE', r'WHERE\\b'),\n",
    "        ('LIMIT', r'LIMIT\\b'),\n",
    "        ('OPTIONAL', r'OPTIONAL\\b'),\n",
    "        ('FILTER', r'FILTER\\b'),\n",
    "        ('VAR', r'\\?[a-zA-Z_]\\w*'),\n",
    "        ('QNAME', r'[a-zA-Z_]\\w*:[a-zA-Z_]\\w*'),\n",
    "        ('IDENT', r':[a-zA-Z_]\\w*'),\n",
    "        ('STRING', r'\"[^\"]*\"(@[a-zA-Z]+)?'),\n",
    "        ('INT', r'\\d+'),\n",
    "        ('OP', r'[=!<>]+'),\n",
    "        ('PUNCT', r'[{}.;,]'),\n",
    "        ('ERROR', r'.')\n",
    "    ]\n",
    "\n",
    "    reconhecidos = []\n",
    "    linha_atual = 1  # contador de linha\n",
    "\n",
    "    tokenreg = '|'.join(f'(?P<{name}>{pattern})' for name, pattern in tokens)\n",
    "    val = re.finditer(tokenreg, codigo)  \n",
    "\n",
    "    for v in val:\n",
    "        dic = v.groupdict()\n",
    "        valor = v.group()\n",
    "        for key in dic:\n",
    "            if dic[key]:\n",
    "                tipo = key\n",
    "                break\n",
    "\n",
    "        if tipo == 'NEWLINE':\n",
    "            linha_atual += 1\n",
    "            reconhecidos.append((tipo, valor, linha_atual, v.span()))\n",
    "        elif tipo != 'SKIP':\n",
    "            reconhecidos.append((tipo, valor, linha_atual, v.span()))\n",
    "\n",
    "    return reconhecidos\n",
    "\n",
    "\n",
    "# Teste\n",
    "linha = \"\"\"SELECT ?nome ?desc WHERE{ \n",
    "?s foaf:name \"Chuck Berry\"@en . \n",
    "?w dbo:artist ?s. \n",
    "?w foaf:name ?nome. \n",
    "?w dbo:abstract ?desc \n",
    "} LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "tokens = Query(linha)\n",
    "for t in tokens:\n",
    "    print(t)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3598918a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
